luiss07/LavaLampEncryption/MSP432/main.c
#include <ti/devices/msp432p4xx/inc/msp.h>
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>
#include <ti/grlib/grlib.h>
#include "LcdDriver/Crystalfontz128x128_ST7735.h"
#include "LcdDriver/HAL_MSP_EXP432P401R_Crystalfontz128x128_ST7735.h"
#include <stdio.h>
#include <math.h>
#include "msp.h"

#define ROWS_FOR_HASH_NUMBER 5
#define DIGITS_OF_HASHED_NUMBER 97
#define DIGITS_OF_HASHED_NUMBER_ARRAY 4
#define MAX_DIGITS_INLINE 19
#define MAX_MENU_SELECTIONS 4
#define MAX_RANDOM_NUMBER_DIGITS 10
#define GENERATE_PAGE_SELECTIONS 5
#define SETTINGS_PAGE_SELECTIONS 3
#define MAX_THEMES 3

/* Graphic library context */
Graphics_Context g_sContext;

/* ADC results buffer */
static uint16_t resultsBuffer[2];

// buttonPressed checks if the joystick button has been pressed
int buttonPressed;
// currentThemeCounter saves the current selected theme
int currentThemeCounter = 0;
char * themes[MAX_THEMES] = {"Dark mode", "Light mode", "Fire"};

uint16_t moveUp = 0;
uint16_t moveDown = 0;
uint16_t moveLeft = 0;
uint16_t moveRight = 0;

uint32_t FOREGROUND_COLOR = GRAPHICS_COLOR_LIME;
uint32_t BACKGROUND_COLOR = GRAPHICS_COLOR_BLACK;
uint32_t SELECTION_COLOR = GRAPHICS_COLOR_DARK_GRAY;

// uint32_t FOREGROUND_COLOR = GRAPHICS_COLOR_BLACK;
// uint32_t BACKGROUND_COLOR = GRAPHICS_COLOR_WHITE;
// uint32_t SELECTION_COLOR = GRAPHICS_COLOR_DARK_GRAY;


bool loadAnimation_user = true;

void _adcInit(){
    /* Configures Pin 6.0 and 4.4 as ADC input */
        GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P6, GPIO_PIN0, GPIO_TERTIARY_MODULE_FUNCTION);
        GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P4, GPIO_PIN4, GPIO_TERTIARY_MODULE_FUNCTION);

        /* Initializing ADC (ADCOSC/64/8) */
        ADC14_enableModule();
        ADC14_initModule(ADC_CLOCKSOURCE_ADCOSC, ADC_PREDIVIDER_64, ADC_DIVIDER_8, 0);

        /* Configuring ADC Memory (ADC_MEM0 - ADC_MEM1 (A15, A9)  with repeat)
             * with internal 2.5v reference */
        ADC14_configureMultiSequenceMode(ADC_MEM0, ADC_MEM1, true);
        ADC14_configureConversionMemory(ADC_MEM0,
                ADC_VREFPOS_AVCC_VREFNEG_VSS,
                ADC_INPUT_A15, ADC_NONDIFFERENTIAL_INPUTS);

        ADC14_configureConversionMemory(ADC_MEM1,
                ADC_VREFPOS_AVCC_VREFNEG_VSS,
                ADC_INPUT_A9, ADC_NONDIFFERENTIAL_INPUTS);

        /* Enabling the interrupt when a conversion on channel 1 (end of sequence)
         *  is complete and enabling conversions */
        ADC14_enableInterrupt(ADC_INT1);

        /* Enabling Interrupts */
        Interrupt_enableInterrupt(INT_ADC14);
        Interrupt_enableMaster();

        /* Setting up the sample timer to automatically step through the sequence
         * convert.
         */
        ADC14_enableSampleTimer(ADC_AUTOMATIC_ITERATION);

        /* Triggering the start of the sample */
        ADC14_enableConversion();
        ADC14_toggleConversionTrigger();
}

void _graphicsInit()
{
    /* Initializes display */
    Crystalfontz128x128_Init();

    /* Set default screen orientation */
    Crystalfontz128x128_SetOrientation(LCD_ORIENTATION_UP);

    Graphics_initContext(&g_sContext, &g_sCrystalfontz128x128, &g_sCrystalfontz128x128_funcs);

    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);

    Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);

    Graphics_setFont(&g_sContext, &g_sFontCmss14b);

    Graphics_clearDisplay(&g_sContext);
}

void _hwInit()
{
    /* Halting WDT and disabling master interrupts */
    WDT_A_holdTimer();
    Interrupt_disableMaster();

    /* Set the core voltage level to VCORE1 */
    PCM_setCoreVoltageLevel(PCM_VCORE1);

    /* Set 2 flash wait states for Flash bank 0 and 1*/
    FlashCtl_setWaitState(FLASH_BANK0, 2);
    FlashCtl_setWaitState(FLASH_BANK1, 2);

    /* Initializes Clock System */
    CS_setDCOCenteredFrequency(CS_DCO_FREQUENCY_48);
    CS_initClockSignal(CS_MCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_HSMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_SMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_ACLK, CS_REFOCLK_SELECT, CS_CLOCK_DIVIDER_1);

    _graphicsInit();
    _adcInit();
}


// Function to restart 2 second timer
void restartTimer2sec() {
    Timer32_setCount(TIMER32_0_BASE, 60000000); // 2 seconds (default was 6000000)
    Timer32_startTimer(TIMER32_0_BASE, true);
}

// Function to restart 1 second timer
void restartTimer500ms() {
    Timer32_setCount(TIMER32_0_BASE, 15000000); // 1 second
    Timer32_startTimer(TIMER32_0_BASE, true);
}

// Function to restart 0.2 second timer
void restartTimer200ms() {
    Timer32_setCount(TIMER32_0_BASE, 6000000); // 0.2 seconds
    Timer32_startTimer(TIMER32_0_BASE, true);
}

// Function to restart 0.05 second timer
void restartTimer50ms() {
    Timer32_setCount(TIMER32_0_BASE, 1500000); // 0.05 seconds
    Timer32_startTimer(TIMER32_0_BASE, true);
}

// Function to check if timer is expired
bool isTimerExpired() {
    return (Timer32_getValue(TIMER32_0_BASE) == 0);
}

void convert_number_to_result(uint8_t *hashedNumber, int hashedNumber_len, char *result_as_string) {

    int number_length;

    int i=0;
    for (; i<hashedNumber_len; i++) {
        // calculate the number of digits of the number (+1 to include the string terminator symbol)
        if (hashedNumber[i] == 0) {
            number_length = 2;
        }
        else {
            number_length = (int)((ceil(log10(hashedNumber[i]))+1)*sizeof(char));
        }
        // define a buffer
        char current_number_to_string[DIGITS_OF_HASHED_NUMBER_ARRAY];

        // save in current_number_to_string the value of the current number in the array
        sprintf(current_number_to_string, "%d", hashedNumber[i]);

        strcat(result_as_string, current_number_to_string);
    }
}

// function to strip a string from its first N chars.
// source: https://stackoverflow.com/questions/4761764/how-to-remove-first-three-characters-from-string-with-c
void chopN(char *str, size_t n) {
    size_t len = strlen(str);
    if (n > len)
        return;  // Or: n = len;
    memmove(str, str+n, len - n + 1);
}

void drawIntegerPage(uint8_t *hashedNumber) {
    Graphics_clearDisplay(&g_sContext);
    // at 14 pixels per character height, 19 numbers can be printed in a single line
    // the hashed number will have at most 32*3 = 96 digits
    //char * result_as_string_old[] = {"164189205253192177", "250547562112152027", "722317114820610423", "711983414318222821", "610464162123108"};
    //char * result_as_string = "164189205253192177250547562112152027722317114820610423711983414318222821610464162123108";

    char result_as_string[ROWS_FOR_HASH_NUMBER*MAX_DIGITS_INLINE] = "";
    //char result_as_string[ROWS_FOR_HASH_NUMBER][MAX_DIGITS_INLINE];
    convert_number_to_result(hashedNumber, 32, result_as_string);

    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    Graphics_drawString(&g_sContext, "The calculated seed is:", -1, 0, 0, true);

    Graphics_setFont(&g_sContext, &g_sFontCmss14b);
    int i = 0;
    for (; i<ROWS_FOR_HASH_NUMBER; i++){
        Graphics_drawString(&g_sContext, result_as_string, MAX_DIGITS_INLINE, 0, 14*(i+2), false);
        chopN(result_as_string, MAX_DIGITS_INLINE-1);
        if (loadAnimation_user) restartTimer500ms();
        while(!isTimerExpired()); // Wait 0.2 seconds
    }

    Graphics_setForegroundColor(&g_sContext, SELECTION_COLOR);
    Graphics_Rectangle myRect = {42, 108, 85, 122};
    Graphics_fillRectangle(&g_sContext, &myRect);

    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    Graphics_drawString(&g_sContext, "Go back", -1, 45, 110, false);

    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
    Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);

