luiss07/LavaLampEncryption/MSP432/main.c
    restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds

    while(buttonPressed == 0) {};
    if (loadAnimation_user) transitionPage();
    mainMenuPage(hashedNumber, loadAnimation_user);
}

void aboutPage(uint8_t *hashedNumber) {
    Graphics_clearDisplay(&g_sContext);
    Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);

    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    Graphics_drawString(&g_sContext, "LavaLamp Encrypt V1.0", -1, 0, 0, true);
    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    if (loadAnimation_user) restartTimer500ms();
    while(!isTimerExpired()); // Wait 0.2 seconds
    Graphics_drawString(&g_sContext, "Contributors:", -1, 0, 24, true);
    Graphics_setFont(&g_sContext, &g_sFontCmss12b);
    if (loadAnimation_user) restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds
    Graphics_drawString(&g_sContext, "Luigi Dell'Eva", -1, 0, 36, true);
    if (loadAnimation_user) restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds
    Graphics_drawString(&g_sContext, "Riccardo Germenia", -1, 0, 48, true);
    if (loadAnimation_user) restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds
    Graphics_drawString(&g_sContext, "Luca Cavalcanti", -1, 0, 60, true);

    Graphics_setForegroundColor(&g_sContext, SELECTION_COLOR);
    Graphics_Rectangle myRect = {42, 108, 85, 122};
    Graphics_fillRectangle(&g_sContext, &myRect);

    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    if (loadAnimation_user) restartTimer500ms();
    while(!isTimerExpired()); // Wait 0.2 seconds
    Graphics_drawString(&g_sContext, "Go back", -1, 45, 110, false);

    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
    Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);

    restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds

    while(buttonPressed == 0) {};
    if (loadAnimation_user) transitionPage();
    mainMenuPage(hashedNumber, loadAnimation_user);
}

void generateRandomNumberPage(uint8_t *hashedNumber) {
    Graphics_clearDisplay(&g_sContext);

    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    Graphics_drawString(&g_sContext, "True Random Number", -1, 10, 0, true);
    Graphics_drawString(&g_sContext, "Generator", -1, 40, 12, true);

    Graphics_drawLineH(&g_sContext, 0, 128, 25);

    int min = 1, max = 100, res;
    char min_to_string[MAX_RANDOM_NUMBER_DIGITS];
    char max_to_string[MAX_RANDOM_NUMBER_DIGITS];
    char res_to_string[MAX_RANDOM_NUMBER_DIGITS];
    sprintf(min_to_string, "%d", min);
    sprintf(max_to_string, "%d", max);

    char conversion_result[ROWS_FOR_HASH_NUMBER*MAX_DIGITS_INLINE] = "";
    convert_number_to_result(hashedNumber, 32, conversion_result);

    //TODO: invent new strange ways to parse the seed
    char seed_from_hash[18] = "";

    strncpy(seed_from_hash, conversion_result, 18);

    srand(atoll(seed_from_hash));

    Graphics_drawString(&g_sContext, "Min: ", -1, 0, 31, true);
    Graphics_drawString(&g_sContext, min_to_string, -1, 30, 31, true);
    Graphics_drawString(&g_sContext, "Max: ", -1, 0, 43, true);
    Graphics_drawString(&g_sContext, max_to_string, -1, 30, 43, true);

    Graphics_drawString(&g_sContext, "GENERATE", -1, 0, 61, true);

    Graphics_drawString(&g_sContext, "Result: ", -1, 0, 79, true);
    //Graphics_drawString(&g_sContext, seed_from_hash, -1, 0, 79, true);

    Graphics_drawString(&g_sContext, "How to", -1, 0, 97, true);

    restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds

    int currentHoveredSelection = 0, offsetY = 31;
    int offsetsY[GENERATE_PAGE_SELECTIONS] = {0, 12, 30, 66, 79};
    int offsetsX[GENERATE_PAGE_SELECTIONS] = {30, 30, 0, 0, 45};
    // array to remember which selection we are hovering on
    bool hoveredSelection[GENERATE_PAGE_SELECTIONS] = {true, false, false, false, false};
    bool selectionChanged = false;

    // array of the different menu selections
    char * menuSelections[GENERATE_PAGE_SELECTIONS] = {min_to_string, max_to_string, "GENERATE", "How to", "Go back"};

    Graphics_setFont(&g_sContext, &g_sFontCmss12);

    // draw the menu selections
    while(1) {
        int i=0;
        for(; i<GENERATE_PAGE_SELECTIONS; i++) {
            if (hoveredSelection[i]) {
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, SELECTION_COLOR);
                Graphics_drawString(&g_sContext, menuSelections[i], -1, offsetsX[i], offsetY + offsetsY[i], true);
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            }
            else {
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
                Graphics_drawString(&g_sContext, menuSelections[i], -1, offsetsX[i], offsetY + offsetsY[i], true);
            }
            if (loadAnimation_user && !selectionChanged) restartTimer200ms();
            while(!isTimerExpired()); // Wait 0.2 seconds
        }
        restartTimer200ms();
        while(!isTimerExpired()); // Wait 0.2 seconds
        while (moveUp == 0 && moveDown == 0 && moveLeft == 0 && moveRight == 0 && buttonPressed == 0) {};
        selectionChanged = true;
        if (moveUp == 1) {
            if (currentHoveredSelection == 0) {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection = GENERATE_PAGE_SELECTIONS - 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
            else {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection -= 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
        }
        else if (moveDown == 1) {
            if (currentHoveredSelection == GENERATE_PAGE_SELECTIONS-1) {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection = 0;
                hoveredSelection[currentHoveredSelection] = true;
            }
            else {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection += 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
        }
        else if (moveRight == 1 && strcmp(menuSelections[currentHoveredSelection], min_to_string) == 0) {
            Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
            Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            if (min < max-1) min += 1;
            sprintf(min_to_string, "%d", min);
            Graphics_drawString(&g_sContext, "                     ", -1, offsetsX[currentHoveredSelection], offsetY + offsetsY[currentHoveredSelection], true);
        }
        else if  (moveRight == 1 && strcmp(menuSelections[currentHoveredSelection], max_to_string) == 0) {
            Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
            Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            max += 1;
            sprintf(max_to_string, "%d", max);
            Graphics_drawString(&g_sContext, "                     ", -1, offsetsX[currentHoveredSelection], offsetY + offsetsY[currentHoveredSelection], true);
        }
        else if (moveLeft == 1 && strcmp(menuSelections[currentHoveredSelection], min_to_string) == 0) {
            Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
            Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            min -= 1;
            sprintf(min_to_string, "%d", min);
            Graphics_drawString(&g_sContext, "                     ", -1, offsetsX[currentHoveredSelection], offsetY + offsetsY[currentHoveredSelection], true);
        }
        else if  (moveLeft == 1 && strcmp(menuSelections[currentHoveredSelection], max_to_string) == 0) {
            Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
            Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            if (max > min+1) max -= 1;
            sprintf(max_to_string, "%d", max);
            Graphics_drawString(&g_sContext, "                     ", -1, offsetsX[currentHoveredSelection], offsetY + offsetsY[currentHoveredSelection], true);
        }
        else if (buttonPressed == 1) {
            if (strcmp(menuSelections[currentHoveredSelection], "How to") == 0) {
                if (loadAnimation_user) transitionPage();
                howToPage(hashedNumber);
            }
            else if (strcmp(menuSelections[currentHoveredSelection], "GENERATE") == 0) {
                strcpy(res_to_string, "");
                res = rand() % max + min;
                sprintf(res_to_string, "%d", res);
                //delete any possible number there was first
                Graphics_drawString(&g_sContext, "                     ", -1, 35, 79, true);
                Graphics_drawString(&g_sContext, res_to_string, -1, 35, 79, true);
            }
            else if (strcmp(menuSelections[currentHoveredSelection], "Go back") == 0) {
                if (loadAnimation_user) transitionPage();
                mainMenuPage(hashedNumber, loadAnimation_user);
            }
        }
        restartTimer200ms();
        while(!isTimerExpired()); // Wait 0.2 seconds
    };
}

void howToPage(uint8_t *hashedNumber) {
    Graphics_clearDisplay(&g_sContext);

    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    Graphics_drawString(&g_sContext, "Usage: TODO", -1, 0, 0, false);

    Graphics_setForegroundColor(&g_sContext, SELECTION_COLOR);
    Graphics_Rectangle myRect = {42, 108, 85, 122};
    Graphics_fillRectangle(&g_sContext, &myRect);

    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    Graphics_drawString(&g_sContext, "Go back", -1, 45, 110, false);

    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
    Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);

