luiss07/LavaLampEncryption/MSP432/main.c
    restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds

    while(buttonPressed == 0) {};
    if (loadAnimation_user) transitionPage();
    generateRandomNumberPage(hashedNumber);
}

void changeTheme(char current_theme[64]) {
    Graphics_clearDisplay(&g_sContext);
    if (strcmp(current_theme, "Dark mode") == 0) {
        FOREGROUND_COLOR = GRAPHICS_COLOR_LIME;
        BACKGROUND_COLOR = GRAPHICS_COLOR_BLACK;
        SELECTION_COLOR = GRAPHICS_COLOR_DARK_GRAY;
    }
    else if (strcmp(current_theme, "Light mode") == 0) {
        FOREGROUND_COLOR = GRAPHICS_COLOR_BLACK;
        BACKGROUND_COLOR = GRAPHICS_COLOR_WHITE;
        SELECTION_COLOR = GRAPHICS_COLOR_DARK_GRAY;
    }
    else if (strcmp(current_theme, "Fire") == 0) {
        FOREGROUND_COLOR = 0x00FF0022;
        BACKGROUND_COLOR = 0x00A3A5C3;
        SELECTION_COLOR =  0x00F0A202;
    }
    //Graphics_clearDisplay(&g_sContext);
}

void settingsPage(uint8_t *hashedNumber) {
    Graphics_clearDisplay(&g_sContext);

    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    Graphics_drawString(&g_sContext, "Theme: ", -1, 0, 0, false);

    Graphics_drawString(&g_sContext, "Animations: ", -1, 0, 15, false);

    restartTimer200ms();
    while(!isTimerExpired()); // Wait 0.2 seconds

    int currentHoveredSelection = 0, offsetY = 0;

    char current_theme[64];
    strcpy(current_theme, themes[currentThemeCounter]);

    char animation_status[5];
    if(loadAnimation_user) {
        strcpy(animation_status, "ON");
    }
    else {
        strcpy(animation_status, "OFF");
    }

    int offsetsY[SETTINGS_PAGE_SELECTIONS] = {0, 15, 110};
    int offsetsX[SETTINGS_PAGE_SELECTIONS] = {40, 55, 20};
    // array to remember which selection we are hovering on
    bool hoveredSelection[SETTINGS_PAGE_SELECTIONS] = {true, false, false};
    bool selectionChanged = false;

    // array of the different menu selections
    char * menuSelections[SETTINGS_PAGE_SELECTIONS] = {current_theme, animation_status, "Go back and save"};

    Graphics_setFont(&g_sContext, &g_sFontCmss12);

    // draw the menu selections
    while(1) {
        Graphics_setFont(&g_sContext, &g_sFontCmss12);
        Graphics_drawString(&g_sContext, "Theme: ", -1, 0, 0, true);

        Graphics_drawString(&g_sContext, "Animations: ", -1, 0, 15, true);
        int i=0;
        for(; i<SETTINGS_PAGE_SELECTIONS; i++) {
            if (hoveredSelection[i]) {
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, SELECTION_COLOR);
                Graphics_drawString(&g_sContext, menuSelections[i], -1, offsetsX[i], offsetY + offsetsY[i], true);
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            }
            else {
                // Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                // Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
                Graphics_drawString(&g_sContext, menuSelections[i], -1, offsetsX[i], offsetY + offsetsY[i], true);
            }
        }
        restartTimer200ms();
        while(!isTimerExpired()); // Wait 0.2 seconds
        while (moveUp == 0 && moveDown == 0 && moveLeft == 0 && moveRight == 0 && buttonPressed == 0) {};
        selectionChanged = true;
        if (moveUp == 1) {
            if (currentHoveredSelection == 0) {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection = SETTINGS_PAGE_SELECTIONS - 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
            else {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection -= 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
        }
        else if (moveDown == 1) {
            if (currentHoveredSelection == SETTINGS_PAGE_SELECTIONS-1) {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection = 0;
                hoveredSelection[currentHoveredSelection] = true;
            }
            else {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection += 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
        }
        else if (moveLeft == 1 && strcmp(menuSelections[currentHoveredSelection], current_theme) == 0) {
            Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
            Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            if (currentThemeCounter == 0) currentThemeCounter = MAX_THEMES - 1;
            else currentThemeCounter--;
            strcpy(current_theme, themes[currentThemeCounter]);
            Graphics_drawString(&g_sContext, "                     ", -1, offsetsX[currentHoveredSelection], offsetY + offsetsY[currentHoveredSelection], true);
        }
        else if ((moveRight == 1 || buttonPressed == 1) && strcmp(menuSelections[currentHoveredSelection], current_theme) == 0) {
            Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
            Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            if (currentThemeCounter == MAX_THEMES - 1) currentThemeCounter = 0;
            else currentThemeCounter++;
            strcpy(current_theme, themes[currentThemeCounter]);
            Graphics_drawString(&g_sContext, "                     ", -1, offsetsX[currentHoveredSelection], offsetY + offsetsY[currentHoveredSelection], true);
        }
        else if ((moveLeft == 1 || moveRight == 1 || buttonPressed == 1) && strcmp(menuSelections[currentHoveredSelection], animation_status) == 0) {
            if (strcmp(menuSelections[currentHoveredSelection], "OFF") == 0) {
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
                loadAnimation_user = true;
                strcpy(animation_status, "ON");
                Graphics_drawString(&g_sContext, "   ", -1, 55, 15, true);
            }
            else if (strcmp(menuSelections[currentHoveredSelection], "ON") == 0) {
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
                loadAnimation_user = false;
                strcpy(animation_status, "OFF");
                Graphics_drawString(&g_sContext, "  ", -1, 55, 15, true);
            }
        }
        else if (buttonPressed == 1) {
            if (strcmp(menuSelections[currentHoveredSelection], "Go back and save") == 0) {
                if (loadAnimation_user) transitionPage();
                mainMenuPage(hashedNumber, loadAnimation_user);
            }
        }
        restartTimer200ms();
        while(!isTimerExpired()); // Wait 0.2 seconds
        changeTheme(themes[currentThemeCounter]);
    };
}

