luiss07/LavaLampEncryption/MSP432/main.c
void transitionPage() {
    Graphics_setFont(&g_sContext, &g_sFontCmss14b);
    Graphics_clearDisplay(&g_sContext);
    char animated_matrix[30][19] = {
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "011 010110 01 001 1",
        "110 00101  11 100 1",
        " 01011100  01 010 0",
        " 1010 011 100101 11",
        " 0 00 111 011 00 01",
        "00 11 1 0 111 01 11",
        "11 10 0 01011 11 10",
        " 0 10 0 110 001 010",
        " 01 0101111 110 110",
        " 00 01001 0 111 111",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
        "                   ",
    };
    char empty_string[19] = "                   ";
    int i=0;
    for(; i<30; i++){
        int j=0;
        for(; j<10; j++) {
            if (i+j < 30) Graphics_drawString(&g_sContext, animated_matrix[29-(i+j)], -1, 0, 14*(9-j), true);
        }
    }
    Graphics_setFont(&g_sContext, &g_sFontCmss12);
}

void mainMenuPage(uint8_t *hashedNumber, bool loadAnimation) {
    Graphics_clearDisplay(&g_sContext);
    Graphics_setFont(&g_sContext, &g_sFontCmss20b);

    char string_top[8] = "LavaLamp";
    int32_t lavaLampColours[8] = {      0x00E80030,
                                        0x00EA4505,
                                        0x00FD6400,
                                        0x00FB6E03,
                                        0x00FDAD00,
                                        0x00FB7905,
                                        0x00A85B00,
                                        0x00A85B02,
    };

    char string_encrypt[11] = "Encrypt 1.0";
    int32_t encryptGradient[11] = {     0x00E5F9BA,
                                        0x00F4DAD3,
                                        0x00D5B4B9,
                                        0x00D2A780,
                                        0x00C28D69,
                                        0x00A5696B,
                                        0x0056365E,
                                        0x00000000,
                                        0x00E5F9BA,
                                        0x00D2A780,
                                        0x0056365E,
    };

    // value to keep track of Y offset
    int offsetY = 0;

    int i;
    for (i = 0; i < 8; i++) {
        Graphics_setForegroundColor(&g_sContext, lavaLampColours[i]);
        if (i==7) {
            Graphics_drawString(&g_sContext, string_top, 1, 90, offsetY, true);
        }
        else Graphics_drawString(&g_sContext, string_top, 1, i*12, offsetY, true);
        //Graphics_drawString(&g_sContext, "LavaLamp", 1, i*8, 0, true);
        chopN(string_top, 1);
        if (loadAnimation) restartTimer50ms();
        while(!isTimerExpired()); // Wait 2 seconds
    }

    offsetY += 20;

    int j;
    for (j = 0; j < 11; j++) {
        Graphics_setForegroundColor(&g_sContext, encryptGradient[j]);
        Graphics_drawString(&g_sContext, string_encrypt, 1, j*11, offsetY, true);
        chopN(string_encrypt, 1);
        if (loadAnimation) restartTimer50ms();
        while(!isTimerExpired()); // Wait 2 seconds
    }


    Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
    //Graphics_drawString(&g_sContext, "LavaLamp", -1, 0, 0, true);
    //Graphics_drawString(&g_sContext, "Encrypt 1.0", -1, 0, 20, true);

    Graphics_drawLineH(&g_sContext, 0, 128, 45);

    offsetY += 40;

    int currentHoveredSelection = 0;
    // array to remember which selection we are hovering on
    bool hoveredSelection[MAX_MENU_SELECTIONS] = {true, false, false, false};

    // array of the different menu selections
    char * menuSelections[MAX_MENU_SELECTIONS] = {"Generated Seed", "Generate Random Number", "About", "Settings"};

    Graphics_setFont(&g_sContext, &g_sFontCmss12);
    bool selectionChanged = false;

    // draw the menu selections
    while(1) {
        int i=0;
        for(; i<MAX_MENU_SELECTIONS; i++) {
            if (hoveredSelection[i]) {
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, SELECTION_COLOR);
                Graphics_drawString(&g_sContext, menuSelections[i], -1, 0, offsetY + 16*i, true);
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
            }
            else {
                Graphics_setForegroundColor(&g_sContext, FOREGROUND_COLOR);
                Graphics_setBackgroundColor(&g_sContext, BACKGROUND_COLOR);
                Graphics_drawString(&g_sContext, menuSelections[i], -1, 0, offsetY + 16*i, true);
            }
            if (loadAnimation && !selectionChanged) restartTimer500ms();
            while(!isTimerExpired()); // Wait 0.2 seconds
        }
        restartTimer200ms();
        while(!isTimerExpired()); // Wait 0.2 seconds
        while (moveUp == 0 && moveDown == 0 && buttonPressed == 0) {};
        selectionChanged = true;
        if (moveUp == 1) {
            if (currentHoveredSelection == 0) {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection = MAX_MENU_SELECTIONS - 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
            else {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection -= 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
        }
        else if (moveDown == 1) {
            if (currentHoveredSelection == MAX_MENU_SELECTIONS-1) {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection = 0;
                hoveredSelection[currentHoveredSelection] = true;
            }
            else {
                hoveredSelection[currentHoveredSelection] = false;
                currentHoveredSelection += 1;
                hoveredSelection[currentHoveredSelection] = true;
            }
        }
        else if (buttonPressed == 1) {
            if (strcmp(menuSelections[currentHoveredSelection], "Generated Seed") == 0) {
                if (loadAnimation_user) transitionPage();
                drawIntegerPage(hashedNumber);
            }
            else if (strcmp(menuSelections[currentHoveredSelection], "Generate Random Number") == 0) {
                if (loadAnimation_user) transitionPage();
                generateRandomNumberPage(hashedNumber);
            }
            else if (strcmp(menuSelections[currentHoveredSelection], "About") == 0) {
                if (loadAnimation_user) transitionPage();
                aboutPage(hashedNumber);
            }
            else if (strcmp(menuSelections[currentHoveredSelection], "Settings") == 0) {
                if (loadAnimation_user) transitionPage();
                settingsPage(hashedNumber);
            }
        }
    };
}

/**
 * main.c
 */
void main(void)
{
    _hwInit();

    //RAND_MAX is 32767...
    //printf("RAND_MAX is %d\n", RAND_MAX);

